Revit 2026 API

# MechanicalEquipmentSetAdd Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Add(
	ISet<ElementId> elemIds
)
```
```vb
Public Sub Add (
	elemIds As ISet(Of ElementId)
)
```
```cpp
public:
void Add(
	ISet<ElementId^>^ elemIds
)
```
```fsharp
member Add :
        elemIds : ISet<ElementId> -> unit
```

#### Parameters

elemIds ISetElementId

#### Reference

MechanicalEquipmentSet Class

Autodesk.Revit.DB.Mechanical Namespace